
&НаКлиенте
Процедура ПолучитьПоЧекам(Команда)
	ПолучитьПоЧекамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПоЧекамНаСервере()
	
	ЗаполнитьТовары();
	
КонецПроцедуры

// <Описание процедуры>
//
&НаСервере
Процедура ЗаполнитьТовары()

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМТовары.Номенклатура КАК Номенклатура,
		|	ЧекККМТовары.Характеристика КАК Характеристика,
		|	ЧекККМТовары.Количество КАК Количество,
		|	ЧекККМТовары.Цена КАК Цена,
		|	ЧекККМТовары.Сумма КАК Сумма,
		|	ЧекККМТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЧекККМТовары.СуммаНДС КАК СуммаНДС,
		|	ЧекККМТовары.РегистрацияПродажи КАК РегистрацияПродажи,
		|	ЧекККМТовары.Склад КАК Склад,
		|	ЧекККМТовары.КлючСвязиСерийныхНомеров КАК КлючСвязиСерийныхНомеров,
		|	ЧекККМТовары.КодСтроки КАК КодСтроки,
		|	ЧекККМТовары.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЧекККМТовары.Резервировать КАК Резервировать
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.ДатаСбораЧековККМ));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаСбораЧековККМ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Товары = РезультатЗапроса.Выгрузить();
	
	Объект.Товары.Загрузить(ТЗ_Товары);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецПроцедуры // ЗаполнитьТовары()
 